


const fs = require('fs')
const chalk = require('chalk')


var ownernum = ['0','94778763517']
//-------------


// Website Api
global.APIs = {
	zenz: 'https://zenzapis.xyz',
	devil: 'https://api-toxic-devil.herokuapp.com/api',
} 
 
global.APIKeys = {
	'https://zenzapis.xyz': '' }
    


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //---------------------------------------------------------------------

   global.worktype = 'public'

   //---------------------------------------------------------------------
   
   
   //---------------------------------------------------------------------

   global.sudo = ['94778763517']
   //-------------
   global.owner = ['94778763517']

   //---------------------------------------------------------------------
   
   global.packname = '𝗤𝗨𝗘𝗘𝗡 𝗖𝗨𝗧𝗜𝗘-𝗠𝗗' 
   //-------------
   global.author = 'ᴛʜᴇsᴀɴᴅᴜ ᴛʜᴇᴡsᴀʀᴀ'

   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MENU URL BUTTON 1 ------------------------

   global.linkbuttid1 = 'ɪɴꜱᴛᴀɢʀᴀᴍ' 
   //-------------
   global.butturl1 = 'https://www.instagram.com/__thes_and.u___/'
   
   //---------------------------------------------------------------------



   //--------------------- MENU URL BUTTON 2 ------------------------

   global.linkbuttid2 = 'ʏᴏᴜᴛᴜʙᴇ'
   //-------------
   global.butturl2 = 'https://youtube.com/c/ThesanduThewsara'
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- ADPLAY OPTIONS ------------------------

   global.linktext = 'ꜱᴜʙꜱᴄʀɪʙᴇ ᴛᴏ ᴍʏ ʏᴏᴜᴛᴜʙᴇ ᴄʜᴀɴɴᴇʟ'
   //-------------
   global.linkurl = 'https://youtube.com/c/ThesanduThewsara'
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN IMAGE  ------------------------

   global.profileimage = 'https://avatars.githubusercontent.com/u/94118388?s=400&u=ef057537939047c70326c1221c8088d0c2602d8b&v=4'
      
   //---------------------------------------------------------------------

//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	

   //--------------------- URL IMAGE  ------------------------

   global.mainimgurl = 'https://avatars.githubusercontent.com/u/94118388?s=400&u=ef057537939047c70326c1221c8088d0c2602d8b&v=4'
      
   //---------------------------------------------------------------------



//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN MENU BUTTON ------------------------
   
   global.mlinktxt1 = 'ʜᴏᴡ ᴛᴏ ᴅᴇᴘʟᴏʏ ʙᴏᴛ'
   //-------------
   global.mlinkurl1 = 'https://youtube.com/c/ThesanduThewsara'
   //------------- 
   
 //------ URL BUTTON 2 -----
   global.mlinktxt2 = null
   //-------------
   global.mlinkurl2 = null
   //-------------
 
 //------ REP BUTTON 1 -----
   global.mbuttxt1 = 'ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅꜱ'
   //-------------
   global.mbutid1 = 'command'
   //-------------
   
 //------ REP BUTTON 2 -----
   global.mbuttxt2 = null 
   //-------------
   global.mbutid2 = null
   //-------------
   
 //------ REP BUTTON 3 -----
   global.mbuttxt3 = null
   //-------------
   global.mbutid3 = null
   //-------------
   
   //---------------------------------------------------------
   
//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ MAIN ============//

//-------------
global.premium = [`${ownernum}`]
//-------------
global.sessionName = 'session'
//-------------
global.prefa = ['','!','.','🐦','🐤','🗿']
//-------------
global.sp = '𒆜'
//-------------
global.devname = '𝚀𝚄𝙴𝙴𝙽 𝙲𝚄𝚃𝙸𝙴 - 𝙼𝙳'
//-------------
global.devNum = ['94778763517']
//-------------
global.greetings = 'Hey  👋🏻'
//-------------
global.listicon = '✩' 
//-------------
global.wm = '𝗤𝗨𝗘𝗘𝗡 𝗖𝗨𝗧𝗜𝗘-𝗠𝗗' 
//-------------
global.botname = '𝗤𝗨𝗘𝗘𝗡 𝗖𝗨𝗧𝗜𝗘-𝗠𝗗'
//-------------
global.icon = '✩' 
//-------------
global.mail = 'tthewsara@gmail.com'
//-------------
global.youtube = 'https://youtube.com/c/ThesanduThewsara'
//-------------
global.github = 'https://github.com/ThesanduT/' 
//-------------
global.insta = 'https://www.instagram.com/__thes_and.u___/' 
//-------------
global.linkname = 'ǫᴜᴇᴇɴ ᴄᴜᴛɪᴇ ᴍᴅ'
//-------------
global.mainfooter = 'ǫᴜᴇᴇɴ ᴄᴜᴛɪᴇ ᴍᴅ' 
//-------------
global.herokuapi = '' 
//-------------
global.herokuapp = '' 


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ Modz ============//

//-------------
global.welcomeactive = true
//-------------
global.alivemess = 'Hey i am alive now'
//-------------
global.aliveimage = true
//-------------
global.speedmode = 'active'
//-------------
global.ownermess = 'ʜᴇʏ ᴛʜɪꜱ ɪꜱ ᴍʏ ᴏᴡɴᴇʀ, ᴘʟᴇᴀꜱᴇ ᴛᴀʟᴋ ɪɴ ᴇɴɢʟɪꜱʜ'
//-------------
global.autoread = false 
//-------------
global.anticall = false 
//-------------





global.thumb = fs.readFileSync('./media/image/Cutie.jpg')

global.mess = {
    success: 'ᴅᴏɴᴇ',
    errr: 'err',
    admin: 'ᴏɴʟʏ ᴀᴅᴍɪɴ',
    botAdmin: 'ɪ ᴡɪʟʟ ᴅᴏ ɪᴛ, ᴍᴀᴋᴇ ᴍᴇ ᴀɴ ᴀᴅᴍɪɴ!',
    owner: 'ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅ!',
    group: 'ᴛʜɪꜱ ɪꜱ ɴᴏᴛ ᴀ ɢʀᴏᴜᴘ ᴄʜᴀᴛ!',
    private: 'ᴛʜɪꜱ ɪꜱ ᴀ ɢʀᴏᴜᴘ, ᴜꜱᴇ ɪᴛ ɪɴ ᴘʀɪᴠᴀᴛᴇ ᴄʜᴀᴛ!',
    bot: 'Bot',
    wait: 'ᴘʟᴇᴀꜱᴇ ᴡᴀɪᴛ...',
    endLimit: 'ʏᴏᴜʀ ᴅᴀɪʟʏ ʟɪᴍɪᴛ ʜᴀꜱ ᴇxᴘɪʀᴇᴅ, ᴛʜᴇ ʟɪᴍɪᴛ ᴡɪʟʟ ʙᴇ ʀᴇꜱᴇᴛ ᴇᴠᴇʀʏ 12 ʜᴏᴜʀꜱ',
    notext: 'ᴇɴᴛᴇʀ ꜱᴇᴀʀᴄʜ ʟɪɴᴋꜱ!',
}
global.limitawal = {
    premium: "Infinity",
    free: 100
}


let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update'${__filename}'`))
	delete require.cache[file]
	require(file)
})
